Repository: GNOME/NetworkManager-openvpn
Catalog: po/*.po
Languages: el

source: Direction parameter for static key mode. If key direction is used, it must be the opposite of that used on the VPN peer. For example, if the peer uses “1”, this connection must use “0”. If you are unsure what value to use, contact your system administrator. config: tls-auth <file> [direction]
el: Παράμετρος κατεύθυνσης για τη λειτουργία στατικού κλειδιού. Αν χρησιμοποιηθεί η κατεύθυνση του κλειδιού, θα πρέπει να είναι αντίθετη από την κατεύθυνση του άλλου υπολογιστή VPN. Για παράδειγμα, αν ο άλλος υπολογιστής χρησιμοποιεί «1», αυτή η σύνδεση θα πρέπει να χρησιμοποιεί «0». Αν δεν είστε βέβαιοι για το ποια τιμή πρέπει να χρησιμοποιήσετε, επικοινωνήστε με το διαχειριστή του συστήματος. config: tls-auth <file> [direction]

source: Key _File
el: _Αρχείο κλειδιού

source: _Mode
el: _Λειτουργία

source: Add an additional layer of encryption or HMAC authentication.
el: Προσθήκη πρόσθετου επιπέδου κρυπτογράφησης ή πιστοποίησης HMAC.

source: _Extra Certificates
el: Επιπλέον _Πιστοποιητικά

source: Specify a file containing one or more PEM certs (concatenated together) that complete the local certificate chain. config: extra-certs <file>
el: Καθορισμός αρχείου που περιέχει ένα ή περισσότερα πιστοποιητικά PEM (συνενωμένα) που ολοκληρώνουν την τοπική αλυσίδα πιστοποιητικών. config: extra-certs <file>

source: TLS ci_pher string
el: Συμβολοσειρά κρυπτο_γράφησης TLS

source: Set a value for the --tls-cipher parameter. This can be useful for working with VPNs using deprecated hashing schemes.
el: Ορισμός τιμής για την παράμετρο --tls-cipher. Αυτό μπορεί να είναι χρήσιμο για εργασία με VPN που χρησιμοποιούν παρωχημένα σχήματα κατακερματισμού (hashing).

source: Additional TLS authentication or encryption
el: Πρόσθετη πιστοποίηση TLS ή κρυπτογράφηση

source: Controls min and max version allowed for TLS.
el: Ελέγχει την ελάχιστη και μέγιστη έκδοση που επιτρέπεται για το TLS.

source: TLS version control
el: Έλεγχος έκδοσης TLS

source: TLS mi_n version
el: Ε_λάχιστη έκδοση TLS

source: Sets the minimum TLS version we will accept from the peer (default is "1.0"). Examples for version include "1.0", "1.1", or "1.2".
el: Ορίζει την ελάχιστη έκδοση TLS που θα αποδεχτούμε από τον ομότιμο (η προεπιλογή είναι "1.0"). Παραδείγματα έκδοσης περιλαμβάνουν "1.0", "1.1", ή "1.2".

source: TLS ma_x version
el: Μέ_γιστη έκδοση TLS

source: Set the maximum TLS version we will use (default is the highest version supported). Examples for version include "1.0", "1.1", or "1.2".
el: Ορίζει τη μέγιστη έκδοση TLS που θα χρησιμοποιήσουμε (η προεπιλογή είναι η νεότερη υποστηριζόμενη). Παραδείγματα έκδοσης περιλαμβάνουν "1.0", "1.1", ή "1.2".

source: _or highest
el: ή _νεότερη

source: If set and version is not recognized, we will only accept the highest TLS version supported by the local SSL implementation.
el: Εάν οριστεί και η έκδοση δεν αναγνωρίζεται, θα αποδεχτούμε μόνο την νεότερη έκδοση TLS που υποστηρίζεται από την τοπική υλοποίηση SSL.

source: TLS Authentication
el: Πιστοποίηση TLS

source: Proxy type: HTTP or Socks. config: http-proxy or socks-proxy
el: Τύπος διαμεσολαβητή: HTTP ή Socks. config: http-proxy ή socks-proxy

source: Proxy _Type
el: _Τύπος διαμεσολαβητή

source: <i>Select this option if your organization requires the use of a proxy server to access the Internet.</i>
el: <i>Επιλέξτε αν ο οργανισμός σας απαιτεί τη χρήση διακομιστή διαμεσολάβησης για πρόσβαση στο διαδίκτυο.</i>

source: S_erver Address
el: _Διεύθυνση διακομιστή

source: Connect to remote host through a proxy with this address. config: http-proxy or socks-proxy
el: Σύνδεση με απομακρυσμένο κεντρικό υπολογιστή μέσα από έναν διαμεσολαβητή με αυτή τη διεύθυνση. config: http-proxy ή socks-proxy

source: _Port
el: _Θύρα

source: Connect to remote host through a proxy with this port. config: http-proxy or socks-proxy
el: Σύνδεση με απομακρυσμένο κεντρικό υπολογιστή μέσα από έναν διαμεσολαβητή με αυτή τη θύρα. config: http-proxy ή socks-proxy

source: _Retry indefinitely when errors occur
el: Επανάλη_ψη επ' άπειρον όταν προκύπτουν σφάλματα

source: Retry indefinitely on proxy errors. It simulates a SIGUSR1 reset. config: http-proxy-retry or socks-proxy-retry
el: Επανάληψη επ' άπειρον σε σφάλματα διαμεσολαβητή. Προσομοιάζει μια επαναφορά SIGUSR1. config: http-proxy-retry ή socks-proxy-retry

source: Proxy _Username
el: Ό_νομα χρήστη διαμεσολαβητή

source: Proxy Passwor_d
el: _Συθνηματικό διαμεσολαβητή

source: HTTP/Socks proxy username passed to OpenVPN when prompted for it.
el: Το όνομα χρήστη διαμεσολαβητή HTTP/Socks πέρασε στο OpenVPN όταν του ζητήθηκε.

source: HTTP/Socks proxy password passed to OpenVPN when prompted for it.
el: Το συνθηματικό διαμεσολαβητή HTTP/Socks πέρασε στο OpenVPN όταν του ζητήθηκε.

source: _Show password
el: Ε_μφάνιση κωδικού πρόσβασης

source: Proxies
el: Διαμεσολαβητές

source: Path mtu _discovery
el: _Ανακάλυψη MTU διαδρομής

source: Connect _timeout
el: _Χρονικό όριο σύνδεσης

source: The timeout in seconds before trying the next server. This timeout includes proxy and TCP connect timeouts. config: connect-timeout <n> | server-poll-timeout <n>
el: Το χρονικό όριο σε δευτερόλεπτα πριν τη δοκιμή του επόμενου διακομιστή. Αυτό το χρονικό όριο περιλαμβάνει τα χρονικά όρια διαμεσολαβητή και σύνδεσης TCP. config: connect-timeout <n> | server-poll-timeout <n>

source: _Push peer info
el: _Προώθηση πληροφοριών ομότιμου

source: Push additional information about the client to server. config: push-peer-info
el: Προώθηση πρόσθετων πληροφοριών σχετικά με τον πελάτη στον διακομιστή. config: push-peer-info

source: Misc
el: Διάφορα

source: Choose an OpenVPN static key…
el: Επιλέξτε στατικό κλειδί OpenVPN…

source: _Select
el: _Επιλογή

source: Choose CRL file
el: Επιλογή αρχείου CRL

source: Choose CRL directory
el: Επιλογή καταλόγου CRL

source: Choose a key file
el: Επιλογή αρχείου κλειδιού

source: Choose extra certificate file
el: Επιλογή επιπλέον αρχείου πιστοποιητικού

source: OpenVPN Static Keys (*.key)
el: Στατικά κλειδιά OpenVPN (*.key)

source: Default
el: Προεπιλεγμένο

source: Don’t verify certificate identification
el: Να μην γίνεται επαλήθευση ταυτότητας πιστοποιητικού

source: Verify whole subject exactly
el: Ακριβής επαλήθευση ολόκληρου του θέματος

source: Verify name exactly
el: Ακριβής επαλήθευση ονόματος

source: Verify name by prefix
el: Επαλήθευση ονόματος βάσει προθέματος

source: Verify subject partially (legacy mode, strongly discouraged)
el: Μερική επαλήθευση θέματος (λειτουργία παλαιού τύπου, δεν συνιστάται)

source: Server
el: Διακομιστής

source: Client
el: Πελάτης

source: (automatic)
el: (αυτόματο)

source: Certificates (TLS)
el: Πιστοποιητικά (TLS)

source: Password with Certificates (TLS)
el: Συνθηματικό με πιστοποιητικά (TLS)

source: could not load UI widget
el: αδυναμία φόρτωσης γραφικού στοιχείου του περιβάλλοντος

source: Compatible with the OpenVPN server.
el: Συμβατό με τον διακομιστή OpenVPN.

source: object class '%s' has no property named '%s'
el: η κλάση αντικειμένου '%s' δεν έχει ιδιότητα με όνομα '%s'

source: property '%s' of object class '%s' is not writable
el: η ιδιότητα '%s' της κλάσης αντικειμένου '%s' δεν είναι εγγράψιμη

source: construct property "%s" for object '%s' can't be set after construction
el: η ιδιότητα κατασκευής "%s" για το αντικείμενο '%s' δεν μπορεί να οριστεί μετά την κατασκευή

source: '%s::%s' is not a valid property name; '%s' is not a GObject subtype
el: το '%s::%s' δεν είναι έγκυρο όνομα ιδιότητας· το '%s' δεν είναι υποτύπος GObject

source: unable to set property '%s' of type '%s' from value of type '%s'
el: αδυναμία ορισμού ιδιότητας '%s' τύπου '%s' από τιμή τύπου '%s'

source: value "%s" of type '%s' is invalid or out of range for property '%s' of type '%s'
el: η τιμή "%s" τύπου '%s' είναι άκυρη ή εκτός εύρους για την ιδιότητα '%s' τύπου '%s'

source: unable to get editor plugin name: %s
el: αδυναμία λήψης ονόματος πρόσθετου επεξεργαστή: %s

source: missing plugin file "%s"
el: λείπει το αρχείο πρόσθετου "%s"

source: cannot load editor plugin: %s
el: αδυναμία φόρτωσης πρόσθετου επεξεργαστή: %s

source: cannot load factory %s from plugin: %s
el: αδυναμία φόρτωσης εργοστασίου %s από το πρόσθετο: %s

source: unknown error creating editor instance
el: άγνωστο σφάλμα κατά τη δημιουργία στιγμιότυπου επεξεργαστή

source: invalid delimiter character '%c'
el: μη έγκυρος χαρακτήρας οριοθέτη '%c'

source: invalid non-utf-8 character
el: με έγκυρος χαρακτήρας μη-utf-8

source: empty host
el: κενός κεντρικός υπολογιστής

source: invalid port
el: μη έγκυρη θύρα

source: invalid protocol
el: μη έγκυρο πρωτόκολλο

source: invalid address “%s”
el: μη έγκυρη διεύθυνση “%s”

source: invalid integer property “%s” or out of range [%d -> %d]
el: με έγκυρη ακέραια ιδιότητα “%s” ή εκτός εύρους [%d -> %d]

source: invalid boolean property “%s” (not yes or no)
el: άκυρη ιδιότητα boolean “%s” (όχι yes ή no)

source: unhandled property “%s” type %s
el: μη διαχειρίσιμη ιδιότητα “%s” τύπου %s

source: property “%s” invalid or not supported
el: η ιδιότητα “%s” είναι άκυρη ή δεν υποστηρίζεται

source: No VPN configuration options.
el: Χωρίς επιλογές διαμόρφωσης VPN.

source: A username is required.
el: Απαιτείται όνομα χρήστη.

source: A password is required.
el: Απαιτείται συνθηματικό.

source: A username and password are required.
el: Απαιτείται όνομα χρήστη και συνθηματικό.

source: A private key password is required.
el: Απαιτείται συνθηματικό ιδιωτικού κλειδιού.

source: An HTTP Proxy username is required.
el: Απαιτείται όνομα χρήστη διαμεσολαβητή HTTP.

source: An HTTP Proxy password is required.
el: Απαιτείται συνθηματικό διαμεσολαβητή HTTP.

source: An HTTP Proxy username and password are required.
el: Απαιτείται όνομα χρήστη και συνθηματικό διαμεσολαβητή HTTP.

source: Could not process the request because the VPN connection settings were invalid.
el: Αδύνατη η επεξεργασία του αιτήματος, επειδή οι ρυθμίσεις της σύνδεσης VPN ήταν μη έγκυρες.

source: Invalid connection type.
el: Μη έγκυρος τύπος σύνδεσης.

source: Could not find the openvpn binary.
el: Αδυναμία εύρεσης του εκτελέσιμου openvpn.

source: Invalid port number “%s”.
el: Μη έγκυρος αριθμός θύρας “%s”.

source: Invalid proto “%s”.
el: Μη έγκυρο πρωτόκολλο “%s”.

source: Invalid proxy type “%s”.
el: Μη έγκυρος τύπος διαμεσολαβητή “%s”.

source: Invalid ping duration “%s”.
el: Μη έγκυρη διάρκεια ping “%s”.

source: Invalid ping-exit duration “%s”.
el: Μη έγκυρη διάρκεια ping-exit “%s”.

source: Invalid ping-restart duration “%s”.
el: Μη έγκυρη διάρκεια ping-restart “%s”.

source: Invalid connect timeout “%s”.
el: Μη έγκυρο χρονικό όριο σύνδεσης “%s”.

source: Invalid max-routes argument “%s”.
el: Μη έγκυρο όρισμα max-routes “%s”.

source: Invalid keysize “%s”.
el: Μη έγκυρο μέγεθος κλειδιού “%s”.

source: Invalid configuration with tls-remote and verify-x509-name.
el: Μη έγκυρη διαμόρφωση με tls-remote και verify-x509-name.

source: Invalid verify-x509-name.
el: Μη έγκυρο verify-x509-name.

source: Invalid reneg seconds “%s”.
el: Μη έγκυρα δευτερόλεπτα επαναδιαπραγμάτευσης “%s”.

source: Invalid TUN MTU size “%s”.
el: Μη έγκυρο μέγεθος TUN MTU “%s”.

source: Invalid fragment size “%s”.
el: Μη έγκυρο μέγεθος αποκόμματος “%s”.

source: A CRL directory can only be specified for connections available to all users
el: Ένας κατάλογος CRL μπορεί να καθοριστεί μόνο για συνδέσεις διαθέσιμες σε όλους τους χρήστες

source: Unknown connection type “%s”.
el: Άγνωστος τύπος σύνδεσης “%s”.

source: User “%s” not found, check NM_OPENVPN_USER.
el: Ο χρήστης “%s” δεν βρέθηκε, ελέγξτε το NM_OPENVPN_USER.

source: Group “%s” not found, check NM_OPENVPN_GROUP.
el: Η ομάδα “%s” δεν βρέθηκε, ελέγξτε το NM_OPENVPN_GROUP.

source: Unhandled pending authentication.
el: Ανεπίλυτη αναμονή πιστοποίησης.

source: Don’t quit when VPN connection terminates
el: Να μην γίνεται έξοδος όταν τερματίζεται η σύνδεση VPN

source: Enable verbose debug logging (may expose passwords)
el: Ενεργοποίηση αναλυτικής καταγραφής αποσφαλμάτωσης (μπορεί να εκθέτει τα συνθηματικά)

source: D-Bus name to use for this instance
el: Ονομασία D-Bus που θα χρησιμοποιηθεί για αυτή τη συνεδρία

source: nm-openvpn-service provides integrated OpenVPN capability to NetworkManager.
el: Το nm-openvpn-service παρέχει ολοκληρωμένες δυνατότητες OpenVPN στο NetworkManager.
