Repository: GNOME/NetworkManager-openvpn
Catalog: po/*.po
Languages: el

source: OpenVPN client
el: Πελάτης OpenVPN

source: Client for OpenVPN virtual private networks
el: Πελάτης για εικονικά ιδιωτικά δίκτυα OpenVPN

source: Support for configuring OpenVPN virtual private network connections.
el: Υποστήριξη για τη ρύθμιση συνδέσεων εικονικού ιδιωτικού δικτύου OpenVPN.

source: OpenVPN is a popular and flexible free-software VPN solution.
el: Το OpenVPN είναι μια δημοφιλής και ευέλικτη λύση VPN ελεύθερου λογισμικού.

source: The advanced options dialog
el: Ο διάλογος προχωρημένων επιλογών

source: The NetworkManager Developers
el: Οι προγραμματιστές του NetworkManager

source: Authentication required
el: Απαιτείται πιστοποίηση

source: Password
el: Συνθηματικό

source: Certificate password
el: Συνθηματικό πιστοποιητικού

source: HTTP proxy password
el: Συνθηματικό διαμεσολαβητή HTTP

source: Challenge response
el: Απάντηση πρόκλησης

source: Authenticate VPN
el: Πιστοποίηση VPN

source: Certificate pass_word:
el: _Συνθηματικό πιστοποιητικού:

source: _HTTP proxy password:
el: Συνθηματικό διαμεσολαβητή _HTTP:

source: You need to authenticate to access the Virtual Private Network “%s”.
el: Χρειάζεστε πιστοποίηση για να αποκτήσετε πρόσβαση στο Ιδιωτικό Εικονικό Δίκτυο (VPN) «%s».

source: option %s expects between %u and %u argument
el: η επιλογή %s αναμένει μεταξύ %u και %u ορίσματα

source: option %s expects no arguments
el: η επιλογή %s δεν αναμένει ορίσματα

source: option %s expects exactly one argument
el: η επιλογή %s αναμένει ακριβώς ένα όρισμα

source: argument %s of “%s” can not be empty
el: το όρισμα %s του «%s» δεν μπορεί να είναι κενό

source: argument of “%s” can not be empty
el: το όρισμα του «%s» δεν μπορεί να είναι κενό

source: argument %s of “%s” must be UTF-8 encoded
el: το όρισμα %s του «%s» πρέπει να έχει κωδικοποίηση UTF-8

source: argument of “%s” must be UTF-8 encoded
el: το όρισμα του «%s» πρέπει να έχει κωδικοποίηση UTF-8

source: invalid %uth argument to “%s” where number expected
el: μη έγκυρο %uο όρισμα στο «%s» όπου αναμενόταν αριθμός

source: unsupported %uth argument %s to “%s”
el: μη υποστηριζόμενο %uο όρισμα %s στο «%s»

source: unsupported %uth argument to “%s” which looks like a FQDN but only IPv4 address supported
el: μη υποστηριζόμενο %uο όρισμα στο «%s» που μοιάζει με FQDN αλλά υποστηρίζεται μόνο διεύθυνση IPv4

source: invalid %uth argument to “%s” where IPv4 address expected
el: μη έγκυρο %uο όρισμα στο «%s» όπου αναμενόταν διεύθυνση IPv4

source: invalid %uth key-direction argument to “%s”
el: μη έγκυρο %uο όρισμα key-direction στο «%s»

source: invalid %uth argument to “%s”
el: μη έγκυρο %uο όρισμα στο «%s»

source: unterminated %s at position %lld
el: μη τερματισμένο %s στη θέση %lld

source: double quote
el: διπλό εισαγωγικό

source: single quote
el: απλό εισαγωγικό

source: trailing escaping backslash at position %lld
el: χαρακτήρας διαφυγής ανάποδης καθέτου στο τέλος, στη θέση %lld

source: unable to read HTTP proxy auth file
el: αδυναμία ανάγνωσης του αρχείου πιστοποίησης του διαμεσολαβητή HTTP

source: cannot read user/password from HTTP proxy auth file
el: αδυναμία ανάγνωσης χρήστη/κωδικού πρόσβασης από το αρχείο πιστοποίησης του διαμεσολαβητή HTTP

source: user/password from HTTP proxy auth file must be UTF-8 encoded
el: ο χρήστης/κωδικός πρόσβασης του αρχείου πιστοποίησης του διαμεσολαβητή HTTP πρέπει να έχουν κωδικοποίηση UTF-8

source: “%s” is not a directory
el: Το «%s» δεν είναι κατάλογος

source: cannot create “%s” directory
el: αδυναμία δημιουργίας του καταλόγου «%s»

source: cannot write <%s> blob from line %ld to file (%s)
el: αδυναμία εγγραφής του <%s> blob από τη γραμμή %ld στο αρχείο (%s)

source: cannot write <%s> blob from line %ld to file “%s”
el: αδυναμία εγγραφής του <%s> blob από τη γραμμή %ld στο αρχείο «%s»

source: proto expects protocol type like “udp” or “tcp”
el: το proto αναμένει τύπο πρωτοκόλλου όπως «udp» ή «tcp»

source: unsupported mtu-disc argument
el: μη υποστηριζόμενο όρισμα mtu-disc

source: unsupported crl-verify argument
el: μη υποστηριζόμενο όρισμα crl-verify

source: invalid option
el: άκυρη επιλογή

source: allow-compression: invalid argument
el: allow-compression: μη έγκυρο όρισμα

source: unsupported comp-lzo argument
el: μη υποστηριζόμενο όρισμα του comp-lzo

source: unsupported compress argument
el: μη υποστηριζόμενο όρισμα compress

source: remote cannot contain space
el: το απομακρυσμένο δε μπορεί να περιέχει κενό χαρακτήρα

source: remote cannot contain comma
el: το απομακρυσμένο δε μπορεί να περιέχει κόμμα

source: remote expects protocol type like “udp” or “tcp”
el: το remote αναμένει τύπο πρωτοκόλλου όπως «udp» ή «tcp»

source: invalid keyword “%s” in tls-version-min
el: μη έγκυρη λέξη κλειδί «%s» στο tls-version-min

source: invalid verify-x509-name type
el: μη έγκυρος τύπος verify-x509-name

source: unsupported blob/xml element
el: μη υποστηριζόμενο στοιχείο blob/xml

source: unterminated blob element <%s>
el: μη τερματισμένο στοιχείο blob <%s>

source: configuration error: %s (line %ld)
el: σφάλμα διαμόρφωσης: %s (γραμμή %ld)

source: unknown or unsupported option
el: άγνωστη ή μη υποστηριζόμενη επιλογή

source: The file to import wasn’t a valid OpenVPN client configuration
el: Το αρχείο προς εισαγωγή δεν ήταν έγκυρη ρύθμιση πελάτη OpenVPN

source: The file to import wasn’t a valid OpenVPN configuration (no remote)
el: Το αρχείο προς εισαγωγή δεν ήταν έγκυρη ρύθμιση OpenVPN (λείπει το remote)

source: The file to import wasn’t a valid OpenVPN configuration (--pkcs12 can not be used with --cert or --key)
el: Το αρχείο προς εισαγωγή δεν ήταν έγκυρη ρύθμιση OpenVPN (το --pkcs12 δεν μπορεί να χρησιμοποιηθεί μαζί με --cert ή --key)

source: The file to import wasn’t a valid OpenVPN configuration (--ca can not be PKCS#12 format)
el: Το αρχείο προς εισαγωγή δεν ήταν έγκυρη ρύθμιση OpenVPN (το --ca δεν μπορεί να είναι μορφής PKCS#12)

source: The file to import wasn’t a valid OpenVPN configuration (missing --ca)
el: Το αρχείο προς εισαγωγή δεν ήταν έγκυρη ρύθμιση OpenVPN (λείπει το --ca)

source: The file to import wasn’t a valid OpenVPN configuration (if you use one of --cert or --key, you must use them both)
el: Το αρχείο προς εισαγωγή δεν ήταν έγκυρη ρύθμιση OpenVPN (αν χρησιμοποιείτε ένα από τα --cert ή --key, πρέπει να τα χρησιμοποιήσετε και τα δύο)

source: The file to import wasn’t a valid OpenVPN configuration (--cert can not be PKCS#12 format.)
el: Το αρχείο προς εισαγωγή δεν ήταν έγκυρη ρύθμιση OpenVPN (το --cert δεν μπορεί να είναι μορφής PKCS#12.)

source: The file to import wasn’t a valid OpenVPN configuration (--key can not be PKCS#12 format.)
el: Το αρχείο προς εισαγωγή δεν ήταν έγκυρη ρύθμιση OpenVPN (το --key δεν μπορεί να είναι μορφής PKCS#12.)

source: missing path argument
el: λείπει το όρισμα διαδρομής

source: connection is not a valid OpenVPN connection
el: η σύνδεση δεν είναι έγκυρη σύνδεση OpenVPN

source: connection was incomplete (missing gateway)
el: η σύνδεση ήταν ελλιπής (λείπει η πύλη δικτύου)

source: failed to write file: %s
el: αδύνατη η εγγραφή του αρχείου: %s

source: Asymmetric
el: Ασύμμετρη

source: Symmetric
el: Συμμετρική

source: Automatic
el: Αυτόματη

source: LZO disabled (legacy)
el: LZO απενεργοποιημένο (παλαιού τύπου)

source: LZO adaptive (legacy)
el: LZO προσαρμόσιμο (παλαιού τύπου)

source: None
el: Χωρίς

source: No
el: Όχι

source: Maybe
el: Ίσως

source: Yes
el: Ναι

source: General
el: Γενικά

source: _Gateway
el: Πύ_λη δικτύου

source: Remote gateway(s), with optional port and protocol (e.g. ovpn.corp.com:1234:tcp). You can specify multiple hosts for redundancy (use commas or spaces as delimiters). config: remote
el: Απομακρυσμένες πύλες δικτύου, με προαιρετική θύρα και πρωτόκολλο (π.χ ovpn.corp.com:1234:tcp). Μπορείτε να ορίσετε πολλαπλά στοιχεία για πλεονασμό (χρησιμοποιήστε κόμματα για διάκριση των καταχωρίσεων). config: remote

source: Authentication
el: Πιστοποίηση

source: User
el: Χρήστης

source: User name
el: Όνομα χρήστη

source: Password passed to OpenVPN when prompted for it. config: auth-user-pass
el: Ο κωδικός πρόσβασης πέρασε στο OpenVPN όταν του ζητήθηκε. config: auth-user-pass

source: Username passed to OpenVPN when prompted for it. If omitted, use the name of the system user that activates the connection. config: auth-user-pass
el: Το όνομα χρήστη που δίνεται στο OpenVPN όταν ζητηθεί. Εάν παραλειφθεί, χρησιμοποιήστε το όνομα του χρήστη συστήματος που ενεργοποιεί τη σύνδεση. config: auth-user-pass

source: Remote IP Address
el: Απομακρυσμένη διεύθυνση IP

source: Local IP Address
el: Τοπική διεύθυνση IP

source: Key Direction
el: Κατεύθυνση κλειδιού

source: Static Key
el: Στατικό Κλειδί

source: Pre-shared file for Static Key encryption mode (non-TLS). config: static <file>
el: Προκοινόχρηστο αρχείο για λειτουργία κρυπτογράφησης στατικού κλειδιού (όχι-TLS). config: static <file>

source: IP address of the remote VPN endpoint. config: ifconfig <l> <rn>
el: Διεύθυνση IP του απομακρυσμένου τελικού σημείου VPN. config: ifconfig <l> <rn>

source: IP address of the local VPN endpoint. config: ifconfig <l> <rn>
el: Διεύθυνση IP του τοπικού τελικού σημείου VPN. config: ifconfig <l> <rn>

source: Direction for Static Key encryption mode (non-TLS). If key direction is used, it must be the opposite of that used on the VPN peer. For example, if the peer uses “1”, this connection must use “0”. If you are unsure what value to use, contact your system administrator. config: static <file> [direction]
el: Κατεύθυνση για τη λειτουργία κρυπτογράφησης στατικού κλειδιού (μη-TLS). Αν χρησιμοποιηθεί η κατεύθυνση του κλειδιού, θα πρέπει να είναι αντίθετη από την κατεύθυνση του άλλου υπολογιστή VPN. Για παράδειγμα, αν ο άλλος υπολογιστής χρησιμοποιεί «1», αυτή η σύνδεση θα πρέπει να χρησιμοποιεί «0». Αν δεν είστε βέβαιοι για το ποια τιμή πρέπει να χρησιμοποιήσετε, επικοινωνήστε με το διαχειριστή του συστήματος. config: static <file> [direction]

source: Type
el: Τύπος

source: Select an authentication mode.
el: Επιλέξτε λειτουργία πιστοποίησης.

source: Ad_vanced…
el: Για προ_χωρημένους…

source: Not required
el: Δεν απαιτείται

source: OpenVPN Advanced Options
el: Προχωρημένες επιλογές OpenVPN

source: Advanced Properties
el: Ιδιότητες για προχωρημένους

source: _Cancel
el: _Ακύρωση

source: _Apply
el: _Εφαρμογή

source: Use custom gateway p_ort
el: Χρήση προσαρμοσμένης _θύρας πύλης δικτύου

source: TCP/UDP port number for peer. (Default value when there is no port for gateway). config: port
el: Αριθμός θύρας TCP/UDP για το ομότιμο. (Η προεπιλεγμένη τιμή όταν δεν υπάρχει θύρα για τη πύλη δικτύου) config: port

source: Use custom _renegotiation interval
el: Χρήση προσαρμοσμένου χρόνου επανα_διαπραγμάτευσης

source: Renegotiate data channel key after the specified number of seconds. config: reneg-sec
el: Επαναδιαπραγμάτευση κλειδιού του καναλιού δεδομένων μετά τον καθορισμένο αριθμό δευτερολέπτων. config: reneg-sec

source: _Data compression
el: Συμπίεση _δεδομένων

source: Use fast LZO compression. config: comp-lzo
el: Χρήση γρήγορης συμπίεσης LZO. config: comp-lzo

source: Enable or disable outgoing traffic compression config: allow-compression asym|yes
el: Ενεργοποίηση ή απενεργοποίηση συμπίεσης εξερχόμενης κίνησης config: allow-compression asym|yes

source: Use a _TCP connection
el: Χρήση σύνδεσης _TCP

source: Use TCP for communicating with remote host. (This is a default setting only used when no protocol is specified for the gateway.) config: proto tcp-client | udp
el: Χρήση TCP για επικοινωνία με απομακρυσμένο κεντρικό υπολογιστή. (Αυτή είναι η προεπιλεγμένη ρύθμιση και χρησιμοποιείται μόνο όταν δεν υπάρχει ορισμένο πρωτόκολλο για τη πύλη δικτύου.) config: proto tcp-client | udp

source: Set _virtual device type
el: Ορισμός τύπου ει_κονικής συσκευής

source: Explicitly set virtual device type and name (TUN/TAP).
el: Ρητός ορισμός τύπου εικονικής συσκευής και ονόματος (TUN/TAP).

source: Explicitly set virtual device type (TUN/TAP). config: dev-type tun | tap
el: Ρητός ορισμός τύπου εικονικής συσκευής (TUN/TAP). config: dev-type tun | tap

source: and _name
el: και ο_νόματος

source: Use custom name for TUN/TAP virtual device (instead of default “tun” or “tap”). config: dev <name>
el: Χρήση προσαρμοσμένου ονόματος για εικονική συσκευή TUN/TAP (αντί των προεπιλεγμένων «tun» ή «tap»). config: dev <name>

source: Use custom tunnel Maximum Transmission _Unit (MTU)
el: Χρήση προσαρμοσμένης _μονάδας μέγιστης μετάδοσης διοχέτευσης (MTU)

source: Take the TUN device MTU to be the specified value and derive the link MTU from it. config: tun-mtu
el: Λήψη της MTU συσκευής TUN στην καθορισμένη τιμή και παραγωγή του συνδέσμου MTU από αυτή. config: tun-mtu

source: Use custom UDP _fragment size
el: Χρήση προσαρμοσμένου μεγέθους _αποκόμματος UDP

source: Enable internal datagram fragmentation with this maximum size. config: fragment
el: Ενεργοποίηση εσωτερικού κατακερματισμού αυτοδύναμου πακέτου με αυτό το μέγιστο μέγεθος. config: fragment

source: Restrict tunnel TCP Maximum _Segment Size (MSS)
el: Περιορισμός διοχέτευσης μέγιστου μεγέθους _αποκόμματος TCP (MSS)

source: Restrict tunnel TCP MSS. config: mssfix
el: Περιορισμός διoχέτευσης MSS TCP. config: mssfix

source: Rando_mize remote hosts
el: _Τυχαία σειρά απομακρυσμένων κεντρικών υπολογιστών

source: Randomize the order of gateways list (remote) as a kind of basic load-balancing measure. config: remote-random
el: Τυχαία σειρά της λίστας πυλών δικτύου (απομακρυσμένης) ως ενός είδους βασικού μέτρου εξισορρόπησης φορτίου. config: remote-random

source: Allo_w Pull FQDN
el: Να επιτρέπεται η _λήψη FQDN

source: Allow client to pull DNS names from server config: allow-pull-fqdn
el: Να επιτρέπεται στον πελάτη να λαμβάνει ονόματα DNS από τον διακομιστή config: allow-pull-fqdn

source: _Prefix remote DNS name with random string
el: _Πρόθεμα στο απομακρυσμένο όνομα DNS με τυχαία συμβολοσειρά

source: Adds a random string to remote DNS name to avoid DNS caching. config: remote-random-hostname
el: Προσθέτει μια τυχαία συμβολοσειρά στο απομακρυσμένο όνομα DNS για την αποφυγή λανθάνουσας μνήμης DNS (caching). config: remote-random-hostname

source: _IPv6 tun link
el: _Σύνδεσμος IPv6 tun

source: Build a tun link capable of forwarding IPv6 traffic config: tun-ipv6
el: Δημιουργία συνδέσμου tun ικανού για προώθηση κίνησης IPv6 config: tun-ipv6

source: Specify pin_g interval
el: Καθορισμός μεσοδιαστήματος pin_g

source: Ping remote over the TCP/UDP control channel if no packets have been sent for at least n seconds. config: ping <n>
el: Ping στο απομακρυσμένο μηχάνημα μέσω του καναλιού ελέγχου TCP/UDP αν δεν έχουν σταλεί πακέτα για τουλάχιστον n δευτερόλεπτα. config: ping <n>

source: Specify _exit or restart ping
el: Καθορισμός ping ε_ξόδου ή επανεκκίνησης

source: Exit or restart after n seconds pass without reception of a ping or other packet from remote. config: ping-exit | ping-restart <n>
el: Έξοδος ή επανεκκίνηση αφού περάσουν n δευτερόλεπτα χωρίς λήψη ping ή άλλου πακέτου από το απομακρυσμένο μηχάνημα. config: ping-exit | ping-restart <n>

source: Accept authenticated packets from any address (F_loat)
el: Αποδοχή πιστοποιημένων πακέτων από οποιαδήποτε διεύθυνση (F_loat)

source: Allow remote peer to change its IP address and/or port number, such as due to DHCP (this is the default if --remote is not used). --float when specified with --remote allows an OpenVPN session to initially connect to a peer at a known address, however if packets arrive from a new address and pass all authentication tests, the new address will take control of the session. This is useful when you are connecting to a peer which holds a dynamic address such as a dial-in user or DHCP client. Essentially, --float tells OpenVPN to accept authenticated packets from any address, not only the address which was specified in the --remote option. config: float
el: Να επιτρέπεται στον απομακρυσμένο ομότιμο να αλλάξει τη διεύθυνση IP ή/και τον αριθμό θύρας του, όπως λόγω DHCP (αυτή είναι η προεπιλογή αν δεν χρησιμοποιηθεί το --remote). Το --float, όταν καθορίζεται μαζί με το --remote, επιτρέπει σε μια συνεδρία OpenVPN να συνδεθεί αρχικά σε έναν ομότιμο σε γνωστή διεύθυνση, ωστόσο, εάν φτάσουν πακέτα από νέα διεύθυνση και περάσουν όλους τους ελέγχους πιστοποίησης, η νέα διεύθυνση θα αναλάβει τον έλεγχο της συνεδρίας. Αυτό είναι χρήσιμο όταν συνδέεστε σε έναν ομότιμο που κατέχει δυναμική διεύθυνση, όπως έναν χρήστη dial-in ή έναν πελάτη DHCP. Ουσιαστικά, το --float λέει στο OpenVPN να αποδέχεται πιστοποιημένα πακέτα από οποιαδήποτε διεύθυνση, όχι μόνο από τη διεύθυνση που καθορίστηκε στην επιλογή --remote. config: float

source: Specify ma_x routes
el: Καθορισμός μέ_γιστων διαδρομών

source: Specify the maximum number of routes the server is allowed to specify. config: max-routes <n>
el: Καθορίστε τον μέγιστο αριθμό διαδρομών που επιτρέπεται να ορίσει ο διακομιστής. config: max-routes <n>

source: Encrypt packets with cipher algorithm. The default is BF-CBC (Blowfish in Cipher Block Chaining mode). config: cipher
el: Κρυπτογράφηση πακέτων με αλγόριθμο κρυπτογράφησης. Η προεπιλογή είναι BF-CBC (Blowfish σε λειτουργία Cipher Block Chaining). config: cipher

source: Use custom _size of cipher key
el: Χρήση προσαρμοσμένου _μεγέθους κλειδιού κρυπτογράφισης

source: Set cipher key size to a custom value. If unspecified, it defaults to cipher-specific size. config: keysize <n>
el: Ορισμός μεγέθους κλειδιού κρυπτογράφισης σε προσαρμοσμένη τιμή. Εάν δεν καθοριστεί, χρησιμοποιείται το προεπιλεγμένο μέγεθος κλειδιού κρυπτογράφισης. config: keysize <n>

source: Authenticate packets with HMAC using message digest algorithm. The default is SHA1. config: auth
el: Επαλήθευση πακέτων με HMAC χρησιμοποιώντας αλγόριθμο αφομοίωσης μηνύματος. Η προεπιλογή είναι SHA1. config: auth

source: Ci_pher
el: Αλγόριθμος κρυπτογράφησης

source: D_ata ciphers
el: _Κρυπτογραφήσεις δεδομένων

source: Da_ta ciphers fallback
el: Εφε_δρικές κρυπτογραφήσεις δεδομένων

source: Configure a cipher that is used to fall back to if we could not determine which cipher the peer is willing to use. config: data-ciphers-fallback
el: Ρυθμίστε μια κρυπτογράφηση που χρησιμοποιείται ως εφεδρική εάν δεν μπορέσουμε να προσδιορίσουμε ποια κρυπτογράφηση είναι διατεθειμένος να χρησιμοποιήσει ο ομότιμος. config: data-ciphers-fallback

source: Restrict the allowed ciphers to be negotiated to the ciphers in cipher-list. cipher-list is a colon-separated list of ciphers like AES-256-GCM:AES-128-GCM. config: data-ciphers
el: Περιορισμός των επιτρεπόμενων κρυπτογραφήσεων προς διαπραγμάτευση σε αυτές της λίστας cipher-list. Η λίστα cipher-list είναι μια λίστα κρυπτογραφήσεων χωρισμένη με άνω-κάτω τελείες, όπως AES-256-GCM:AES-128-GCM. config: data-ciphers

source: _HMAC Authentication
el: Πιστοποίηση HMAC

source: Disable cipher _negotiation
el: Απενεργοποίηση _διαπραγμάτευσης κρυπτογράφησης

source: Disable cipher negotiation between client and server. config: ncp-disable
el: Απενεργοποίηση διαπραγμάτευσης κρυπτογράφησης μεταξύ πελάτη και διακομιστή. config: ncp-disable

source: Verify CRL from _file
el: Επαλήθευση CRL από _αρχείο

source: Check peer certificate against the specified file in PEM format. A CRL (certificate revocation list) is used when a particular key is compromised but when the overall PKI is still intact.
el: Έλεγχος πιστοποιητικού ομότιμου ως προς το καθορισμένο αρχείο σε μορφή PEM. Μια CRL (λίστα ανάκλησης πιστοποιητικών) χρησιμοποιείται όταν ένα συγκεκριμένο κλειδί έχει παραβιαστεί αλλά η συνολική PKI παραμένει ανέπαφη.

source: Verify CRL from _directory
el: Επαλήθευση CRL από _κατάλογο

source: Check peer certificate by looking at files in the specified directory. The directory must contain files named as revoked serial numbers (the files may be empty, the contents are never read).
el: Έλεγχος πιστοποιητικού ομότιμου κοιτάζοντας αρχεία στον καθορισμένο κατάλογο. Ο κατάλογος πρέπει να περιέχει αρχεία με ονόματα ανακληθέντων σειριακών αριθμών (τα αρχεία μπορεί να είναι κενά, τα περιεχόμενα δεν διαβάζονται ποτέ).

source: (None)
el: (Κανένα)

source: Security
el: Ασφάλεια

source: _Subject Match
el: Ταύτιση _Θέματος

source: Subject or Common Name to verify server certificate information against. config: verify-x509-name subject-or-name [mode] config (legacy mode): tls-remote subject-or-name
el: Θέμα ή Κοινό Όνομα (Common Name) για επαλήθευση των πληροφοριών πιστοποιητικού του διακομιστή. config: verify-x509-name subject-or-name [mode] config (legacy mode): tls-remote subject-or-name

source: Server Cert_ificate Check
el: Έλεγχος Πιστο_ποιητικού Διακομιστή

source: Verify server certificate identification. When enabled, connection will only succeed if the server certificate matches some expected properties. Matching can either apply to the whole certificate subject (all the fields), or just the Common Name (CN field). The legacy option tls-remote is deprecated and removed from OpenVPN 2.4 and newer. Do not use it anymore. config: verify-x509-name subject-or-name [mode] config (legacy mode): tls-remote subject-or-name
el: Επαλήθευση ταυτότητας πιστοποιητικού διακομιστή. Όταν ενεργοποιηθεί, η σύνδεση θα επιτύχει μόνο εάν το πιστοποιητικό του διακομιστή ταιριάζει με κάποιες αναμενόμενες ιδιότητες. Η ταύτιση μπορεί να εφαρμοστεί είτε σε ολόκληρο το θέμα του πιστοποιητικού (όλα τα πεδία), είτε μόνο στο Κοινό Όνομα (πεδίο CN). Η παλαιά επιλογή tls-remote έχει καταργηθεί και αφαιρεθεί από το OpenVPN 2.4 και νεότερο. Μην τη χρησιμοποιείτε πλέον. config: verify-x509-name subject-or-name [mode] config (legacy mode): tls-remote subject-or-name

source: Verify peer (server) certificate _usage signature
el: Επαλήθευση υπογραφής χρήσης πιστοποιητικού ομότιμου (διακομιστή)

source: Require that peer certificate was signed with an explicit key usage and extended key usage based on RFC3280 TLS rules.
el: Απαιτείται αυτό το πιστοποιητικό ομότιμου να έχει υπογραφεί με χρήση ρητού κλειδιού και επεκταμένη χρήση κλειδιού με βάση τους κανόνες TLS RFC3280.

source: Remote peer certificate _TLS type
el: _Τύπος TLS απομακρυσμένου πιστοποιητικού ομότιμου

source: Require that peer certificate was signed with an explicit key usage and extended key usage based on RFC3280 TLS rules. config: remote-cert-tls client|server
el: Απαιτείται αυτό το πιστοποιητικό ομότιμου να έχει υπογραφεί με χρήση ρητού κλειδιού και επεκταμένη χρήση κλειδιού με βάση τους κανόνες TLS RFC3280. config: remote-cert-tls client|server

source: _Verify peer (server) certificate nsCertType designation
el: _Επαλήθευση προσδιορισμού nsCertType πιστοποιητικού ομότιμου (διακομιστή)

source: Require that peer certificate was signed with an explicit nsCertType designation.
el: Απαιτείται αυτό το πιστοποιητικό ομότιμου να έχει υπογραφεί με ρητό προσδιορισμό nsCertType.

source: _Remote peer certificate nsCert designation
el: Προσδιορισμός nsCert πιστοποιητικού απομακρυσμένου ομότιμου

source: Require that peer certificate was signed with an explicit nsCertType designation. config: ns-cert-type client|server
el: Απαιτείται αυτό το πιστοποιητικό ομότιμου να έχει υπογραφεί με ρητό προσδιορισμό nsCertType. config: ns-cert-type client|server

source: Key _Direction
el: _Κατεύθυνση κλειδιού

source: Add an additional layer of HMAC authentication on top of the TLS control channel to protect against DoS attacks. In case of TLS-Crypt mode, the control channel is also encrypted. config: tls-auth <file> [direction] | tls-crypt <file>
el: Προσθήκη πρόσθετου επιπέδου πιστοποίησης HMAC στην κορυφή του καναλιού ελέγχου TLS για προστασία κατά επιθέσεων DoS. Στην περίπτωση λειτουργίας TLS-Crypt, το κανάλι ελέγχου κρυπτογραφείται επίσης. config: tls-auth <file> [direction] | tls-crypt <file>
